# EnterValidRealGreaterThan Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..EnterValidRealGreaterThan Property
BuiltInFailures..::..GeneralFailures Class See Also
---
Enter a number greater than [Value].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId EnterValidRealGreaterThan { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnterValidRealGreaterThan As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ EnterValidRealGreaterThan {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace